Programming-Web.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-05-18 Fri 10:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Web Programming</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jonathan Arkell" />
<link href="https://fonts.googleapis.com/css?family=Inconsolata|Nixie+One|Taviraj:300,400" rel="stylesheet"><link href="./assets/styles/tufte-style.css" rel="stylesheet"></head>
<body>
<div id="preamble" class="status">
<menu class="top"><a href="index.html"> Index </a><a href="Emagician.html"> Emagician </a><a href="Emagician-Base.html"> Base </a><a href="Emagician-Install.html"> Install </a><a href="Emagician-Meta.html"> Meta </a><a href="Interface.html"> Interface </a><a href="Programming.html"> Programming </a><a href="Text.html"> Text </a><a href="Org-Grimoire.html"> Org </a><a href="Lamp.html"> Lamp </a><a href="Journal.html"> Journal </a><a href="Snippets.html"> Snippets </a></menu><menu class="ext"><a class="dotnet" href="http://www.jonnay.net/">jonnay.net</a><a class="github" href="https://github.com/jonnay/emagicians-starter-kit">Fork on Github</a></menu>
</div>
<div id="content">
<h1 class="title">Web Programming</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org84c0f21">1. Interface</a>
<ul>
<li><a href="#org2fbbbfb">1.1. Completion&#xa0;&#xa0;&#xa0;<span class="tag"><span class="completion">completion</span></span></a></li>
<li><a href="#orgd1c12af">1.2. Colors</a></li>
</ul>
</li>
<li><a href="#org5b95d0e">2. Modes</a>
<ul>
<li><a href="#org5a8fbc4">2.1. Web Mode</a>
<ul>
<li><a href="#org020315d">2.1.1. Mode setup</a></li>
</ul>
</li>
<li><a href="#org4b1affb">2.2. Stylesheets</a>
<ul>
<li><a href="#org36b153d">2.2.1. CSS Mode</a></li>
<li><a href="#org4d13e3c">2.2.2. Less mode</a></li>
<li><a href="#org1d4a522">2.2.3. SCSS Mode</a></li>
<li><a href="#orgbd57bc4">2.2.4. They should descend from prog-mode, but they don't!</a></li>
</ul>
</li>
<li><a href="#org2247409">2.3. Coffeescript</a></li>
</ul>
</li>
<li><a href="#orgc77f3f8">3. Helpers</a>
<ul>
<li><a href="#org8705d8c">3.1. Apache Mode</a></li>
<li><a href="#org3f8b2ad">3.2. Restclient Mode&#xa0;&#xa0;&#xa0;<span class="tag"><span class="completion">completion</span></span></a></li>
<li><a href="#org968ea50">3.3. Fontawesome mode</a>
<ul>
<li><a href="#orgc5dbb6a">3.3.1. Prettify Fontawesome</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org7a43e47">4. Interpreters</a>
<ul>
<li><a href="#org2e700ab">4.1. Skewer</a></li>
</ul>
</li>
<li><a href="#org0528ac4">5. Documentation</a>
<ul>
<li><a href="#orgde18a48">5.1. HTTP Well</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org84c0f21" class="outline-2">
<h2 id="org84c0f21"><span class="section-number-2">1</span> Interface</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org2fbbbfb" class="outline-3">
<h3 id="org2fbbbfb"><span class="section-number-3">1.1</span> Completion&#xa0;&#xa0;&#xa0;<span class="tag"><span class="completion">completion</span></span></h3>
<div class="outline-text-3" id="text-1-1">
<pre class="code"><code>(<span class="org-keyword">use-package</span> <span class="org-constant">company-web</span>)
(<span class="org-keyword">use-package</span> <span class="org-constant">ac-html-bootstrap</span>)
</code></pre>
</div>
</div>

<div id="outline-container-orgd1c12af" class="outline-3">
<h3 id="orgd1c12af"><span class="section-number-3">1.2</span> Colors</h3>
<div class="outline-text-3" id="text-1-2">
<pre class="code"><code>(<span class="org-keyword">use-package</span> <span class="org-constant">rainbow-mode</span>
  <span class="org-builtin">:diminish</span> <span class="org-string">"&#127752;"</span>
  <span class="org-builtin">:hook</span> (scss-mode less-mode css-mode))
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org5b95d0e" class="outline-2">
<h2 id="org5b95d0e"><span class="section-number-2">2</span> Modes</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org5a8fbc4" class="outline-3">
<h3 id="org5a8fbc4"><span class="section-number-3">2.1</span> Web Mode</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org020315d" class="outline-4">
<h4 id="org020315d"><span class="section-number-4">2.1.1</span> Mode setup</h4>
<div class="outline-text-4" id="text-2-1-1">
<pre class="code"><code>(<span class="org-keyword">use-package</span> <span class="org-constant">web-mode</span>
  <span class="org-builtin">:diminish</span> <span class="org-string">"&#127758;"</span>
  <span class="org-builtin">:mode</span> 
  ((<span class="org-string">"\\.phtml\\'"</span> . web-mode)
  (<span class="org-string">"\\.tpl\\.php\\'"</span> . web-mode)      
  (<span class="org-string">"\\.jsp\\'"</span> . web-mode)            
  (<span class="org-string">"\\.as[cp]x\\'"</span> . web-mode)        
  (<span class="org-string">"\\.erb\\'"</span> . web-mode)            
  (<span class="org-string">"\\.mustache\\'"</span> . web-mode)       
  (<span class="org-string">"\\.djhtml\\'"</span> . web-mode)         
  (<span class="org-string">"\\.jst.ejs\\'"</span> . web-mode)        
  (<span class="org-string">"\\.html?\\'"</span> . web-mode))
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> web-mode-enable-block-face t)
  (<span class="org-keyword">setq</span> web-mode-enable-comment-keywords t)
  (<span class="org-keyword">setq</span> web-mode-enable-current-element-highlight t)
  (<span class="org-keyword">setq</span> web-mode-enable-current-column-highlight t)   
  (<span class="org-keyword">setq</span> web-mode-script-padding 2)
  (<span class="org-keyword">setq</span> web-mode-style-padding 2)
  (<span class="org-keyword">setq</span> web-mode-comment-style 2)
  (<span class="org-keyword">setq</span> web-mode-code-indent-offset 2)
  (<span class="org-keyword">setq</span> web-mode-markup-indent-offset 2))
</code></pre>
</div>
</div>
</div>
<div id="outline-container-org4b1affb" class="outline-3">
<h3 id="org4b1affb"><span class="section-number-3">2.2</span> Stylesheets</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-org36b153d" class="outline-4">
<h4 id="org36b153d"><span class="section-number-4">2.2.1</span> CSS Mode</h4>
<div class="outline-text-4" id="text-2-2-1">
<pre class="code"><code>(<span class="org-keyword">setq</span> css-indent-level 2)
(<span class="org-keyword">setq</span> css-indent-offset 2)
</code></pre>
</div>
</div>

<div id="outline-container-org4d13e3c" class="outline-4">
<h4 id="org4d13e3c"><span class="section-number-4">2.2.2</span> Less mode</h4>
<div class="outline-text-4" id="text-2-2-2">
<pre class="code"><code>(<span class="org-keyword">use-package</span> <span class="org-constant">less-css-mode</span>)
</code></pre>
</div>
</div>

<div id="outline-container-org1d4a522" class="outline-4">
<h4 id="org1d4a522"><span class="section-number-4">2.2.3</span> SCSS Mode</h4>
<div class="outline-text-4" id="text-2-2-3">
<pre class="code"><code>(<span class="org-keyword">use-package</span> <span class="org-constant">scss-mode</span>
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> scss-compile-at-save nil))
</code></pre>
</div>
</div>
<div id="outline-container-orgbd57bc4" class="outline-4">
<h4 id="orgbd57bc4"><span class="section-number-4">2.2.4</span> They should descend from prog-mode, but they don't!</h4>
<div class="outline-text-4" id="text-2-2-4">
<pre class="code"><code>(<span class="org-keyword">emagician/defhook</span> run-prog-mode-hooks css-mode-hook
  <span class="org-string">"Runs the progmode hooks"</span>
  (run-hooks 'prog-mode-hook))

(add-hook 'scss-mode-hook 'run-prog-mode-hooks)
</code></pre>
</div>
</div>
</div>

<div id="outline-container-org2247409" class="outline-3">
<h3 id="org2247409"><span class="section-number-3">2.3</span> Coffeescript</h3>
<div class="outline-text-3" id="text-2-3">
<pre class="code"><code>(<span class="org-keyword">use-package</span> <span class="org-constant">coffee-mode</span>
  <span class="org-builtin">:diminish</span> <span class="org-string">"&#9749;"</span>
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">setq</span> coffee-tab-width 2))
</code></pre>
</div>
</div>
</div>

<div id="outline-container-orgc77f3f8" class="outline-2">
<h2 id="orgc77f3f8"><span class="section-number-2">3</span> Helpers</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org8705d8c" class="outline-3">
<h3 id="org8705d8c"><span class="section-number-3">3.1</span> Apache Mode</h3>
<div class="outline-text-3" id="text-3-1">
<pre class="code"><code>(<span class="org-keyword">use-package</span> <span class="org-constant">apache-mode</span>)
</code></pre>
</div>
</div>
<div id="outline-container-org3f8b2ad" class="outline-3">
<h3 id="org3f8b2ad"><span class="section-number-3">3.2</span> Restclient Mode&#xa0;&#xa0;&#xa0;<span class="tag"><span class="completion">completion</span></span></h3>
<div class="outline-text-3" id="text-3-2">
<pre class="code"><code>(<span class="org-keyword">use-package</span> <span class="org-constant">restclient</span>
  <span class="org-builtin">:init</span>
  (<span class="org-keyword">use-package</span> <span class="org-constant">company-restclient</span>))
</code></pre>
</div>
</div>
<div id="outline-container-org968ea50" class="outline-3">
<h3 id="org968ea50"><span class="section-number-3">3.3</span> Fontawesome mode</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Insert fontawesome icons.
</p>

<pre class="code"><code>(<span class="org-keyword">use-package</span> <span class="org-constant">fontawesome</span>)
</code></pre>
</div>

<div id="outline-container-orgc5dbb6a" class="outline-4">
<h4 id="orgc5dbb6a"><span class="section-number-4">3.3.1</span> Prettify Fontawesome</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
Take fontawesome-alist, append fa- to the name, and use that as the list for prettify-mode
</p>
<pre class="code"><code>(<span class="org-keyword">emagician/defhook</span> emagician-prettify-fontawesome web-mode-hook
  (<span class="org-keyword">setq</span> prettify-symbols-alist (mapcar (<span class="org-keyword">lambda</span> (fa-cons)
                                         (cons (concat <span class="org-string">"fa-"</span> (car fa-cons))
                                               (aref (cdr fa-cons) 0)))
                                       fontawesome-alist)))
</code></pre>

<p>
Now you can type out <code>&lt;i icon="fa fa-tree"&gt;</code> and it comes out <code>&lt;i icon="fa "&gt;</code>
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org7a43e47" class="outline-2">
<h2 id="org7a43e47"><span class="section-number-2">4</span> Interpreters</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org2e700ab" class="outline-3">
<h3 id="org2e700ab"><span class="section-number-3">4.1</span> Skewer</h3>
<div class="outline-text-3" id="text-4-1">
<pre class="code"><code>(<span class="org-keyword">use-package</span> <span class="org-constant">skewer-mode</span>
  <span class="org-builtin">:init</span> 
  (<span class="org-keyword">setq</span> httpd-port 8123))

(<span class="org-keyword">use-package</span> <span class="org-constant">skewer-reload-stylesheets</span>
  <span class="org-builtin">:init</span> (add-hook 'css-mode-hook 'skewer-reload-stylesheets-start-editing)
        (add-hook 'scss-mode-hook 'skewer-reload-stylesheets-start-editing))

</code></pre>
</div>
</div>
</div>
<div id="outline-container-org0528ac4" class="outline-2">
<h2 id="org0528ac4"><span class="section-number-2">5</span> Documentation</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgde18a48" class="outline-3">
<h3 id="orgde18a48"><span class="section-number-3">5.1</span> HTTP Well</h3>
<div class="outline-text-3" id="text-5-1">
<pre class="code"><code>(<span class="org-keyword">use-package</span> <span class="org-constant">know-your-http-well</span>)
</code></pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jonathan Arkell</p>
<p class="date">Created: 2018-05-18 Fri 10:30</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
